# Springboard Data Science Career Track Unit 4 Challenge - Tier 3 Complete

#### 1.1. Importing Libraries

In [1]:
import pandas as pd
import numpy as np

#### 1.2.  Loading the data

In [2]:
path = 'UK_House_price_index.xlsx'
data = pd.read_excel(path, sheet_name='Average price', index_col= None)

**2.1. Exploring your data** 

Think about your pandas functions for checking out a dataframe.

In [3]:
data

,Unnamed: 0,City of London,Barking & Dagenham,Barnet,Bexley,Brent,Bromley,Camden,Croydon,Ealing,...,NORTH WEST,YORKS & THE HUMBER,EAST MIDLANDS,WEST MIDLANDS,EAST OF ENGLAND,LONDON,SOUTH EAST,SOUTH WEST,Unnamed: 47,England
0,NaT,E09000001,E09000002,E09000003,E09000004,E09000005,E09000006,E09000007,E09000008,E09000009,...,E12000002,E12000003,E12000004,E12000005,E12000006,E12000007,E12000008,E12000009,NaN,E92000001
1,1995-01-01,91449,50460.2,93284.5,64958.1,71306.6,81671.5,120933,69158.2,79885.9,...,43958.5,44803.4,45544.5,48527.5,56701.6,74435.8,64018.9,54705.2,NaN,53202.8
2,1995-02-01,82202.8,51085.8,93190.2,64787.9,72022.3,81657.6,119509,68951.1,80897.1,...,43925.4,44528.8,46051.6,49341.3,56593.6,72777.9,63715,54356.1,NaN,53096.2
3,1995-03-01,79120.7,51269,92247.5,64367.5,72015.8,81449.3,120282,68712.4,81379.9,...,44434.9,45200.5,45383.8,49442.2,56171.2,73896.8,64113.6,53583.1,NaN,53201.3
4,1995-04-01,77101.2,53133.5,90762.9,64277.7,72965.6,81124.4,120098,68610,82188.9,...,44267.8,45614.3,46124.2,49455.9,56567.9,74455.3,64623.2,54786,NaN,53590.9
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
301,2020-01-01,747611,303653,518542,334765,423161,435532,815512,371227,466491,...,165094,164752,196199,202085,290335,478489,323422,257822,NaN,248950
302,2020-02-01,777640,304265,519121,337760,467145,435704,825249,371357,465614,...,166291,164949,194214,200196,290309,479628,319827,257101,NaN,248232
303,2020-03-01,844989,304099,527747,339215,461398,434625,870107,370872,478565,...,168161,165685,198284,201369,291356,488185,326701,262444,NaN,251539
304,2020-04-01,867841,283139,526553,346840,494455,443482,870627,386738,502107,...,167809,165561,200513,202093,295640,480425,327413,255891,NaN,250874
305,2020-05-01,899831,295744,532503,339408,466574,420036,862209,369791,490596,...,168261,170198,197505,203658,290621,479018,324659,261006,NaN,251973

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 306 entries, 0 to 305
Data columns (total 49 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Unnamed: 0            305 non-null    datetime64[ns]
 1   City of London        306 non-null    object
 2   Barking & Dagenham    306 non-null    object
 3   Barnet                306 non-null    object
 4   Bexley                306 non-null    object
 5   Brent                 306 non-null    object
 6   Bromley               306 non-null    object
 7   Camden                306 non-null    object
 8   Croydon               306 non-null    object
 9   Ealing                306 non-null    object
 10  Enfield               306 non-null    object
 11  Greenwich             306 non-null    object
 12  Hackney               306 non-null    object
 13  Hammersmith & Fulham  306 non-null    object
 14  Haringey              306 non-null    object
 15  Harrow                306 non-null    object
 16  Havering              306 non-null    object
 17  Hillingdon            306 non-null    object
 18  Hounslow              306 non-null    object
 19  Islington             306 non-null    object
 20  Kensington & Chelsea  306 non-null    object
 21  Kingston upon Thames  306 non-null    object
 22  Lambeth               306 non-null    object
 23  Lewisham              306 non-null    object
 24  Merton                306 non-null    object
 25  Newham                306 non-null    object
 26  Redbridge             306 non-null    object
 27  Richmond upon Thames  306 non-null    object
 28  Southwark             306 non-null    object
 29  Sutton                306 non-null    object
 30  Tower Hamlets         306 non-null    object
 31  Waltham Forest        306 non-null    object
 32  Wandsworth            306 non-null    object
 33  Westminster           306 non-null    object
 34  Unnamed: 34           0 non-null      float64
 35  Inner London          306 non-null    object
 36  Outer London          306 non-null    object
 37  Unnamed: 37           0 non-null      float64
 38  NORTH EAST            306 non-null    object
 39  NORTH WEST            306 non-null    object
 40  YORKS & THE HUMBER    306 non-null    object
 41  EAST MIDLANDS         306 non-null    object
 42  WEST MIDLANDS         306 non-null    object
 43  EAST OF ENGLAND       306 non-null    object
 44  LONDON                306 non-null    object
 45  SOUTH EAST            306 non-null    object
 46  SOUTH WEST            306 non-null    object
 47  Unnamed: 47           0 non-null      float64
 48  England               306 non-null    object
dtypes: datetime64[ns](1), float64(3), object(45)
memory usage: 117.3+ KB

**2.2. Cleaning the data**

You might find you need to transpose your dataframe, check out what its row indexes are, and reset the index. You  also might find you need to assign the values of the first row to your column headings  . (Hint: recall the .columns feature of DataFrames, as well as the iloc[] method).

Don't be afraid to use StackOverflow for help  with this.

In [5]:
data.dropna(how='all', axis=1, inplace=True)

In [6]:
data.drop(columns=['City of London'],inplace = True)

In [7]:
data.rename(columns={'Unnamed: 0': 'Date'}, inplace=True)

In [8]:
data = data.loc[1:, 'Date': 'Westminster']

**2.3. Cleaning the data (part 2)**

You might we have to **rename** a couple columns. How do you do this? The clue's pretty bold...

In [9]:
data.columns

Index(['Date', 'Barking & Dagenham', 'Barnet', 'Bexley', 'Brent', 'Bromley',
       'Camden', 'Croydon', 'Ealing', 'Enfield', 'Greenwich', 'Hackney',
       'Hammersmith & Fulham', 'Haringey', 'Harrow', 'Havering', 'Hillingdon',
       'Hounslow', 'Islington', 'Kensington & Chelsea', 'Kingston upon Thames',
       'Lambeth', 'Lewisham', 'Merton', 'Newham', 'Redbridge',
       'Richmond upon Thames', 'Southwark', 'Sutton', 'Tower Hamlets',
       'Waltham Forest', 'Wandsworth', 'Westminster'],
      dtype='object')

**2.4.Transforming the data**

Remember what Wes McKinney said about tidy data? 

You might need to **melt** your DataFrame here.

In [10]:
data = pd.melt(data, id_vars = 'Date', var_name='District', value_name='Price')

In [11]:
data.Price = data.Price.astype('float')

In [12]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9760 entries, 0 to 9759
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      9760 non-null   datetime64[ns]
 1   District  9760 non-null   object
 2   Price     9760 non-null   float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 228.9+ KB

**2.5. Cleaning the data (part 3)**

Do we have an equal number of observations in the ID, Average Price, Month, and London Borough columns? Remember that there are only 32 London Boroughs. How many entries do you have in that column? 

Check out the contents of the London Borough column, and if you find null values, get rid of them however you see fit.

In [13]:
data.District.nunique()

32

**3.1 Answering the Question**

Which borough of London has seen the greatest average increase in housing prices over
the (approximately) two decades covered by the dataset?

In [14]:
data['year'] = pd.DatetimeIndex(data.Date).year

In [15]:
last_20_yrs = data.loc[data.year >= 2001].copy()

In [16]:
last_20_yrs = last_20_yrs.groupby(['District', 'year']).Price.mean().reset_index().rename(columns={'Price': 'avg_price'})

In [17]:
last_20_yrs

               District  year     avg_price
0    Barking & Dagenham  2001  8.866406e+04
1    Barking & Dagenham  2002  1.122219e+05
2    Barking & Dagenham  2003  1.424989e+05
3    Barking & Dagenham  2004  1.581760e+05
4    Barking & Dagenham  2005  1.633608e+05
..                  ...   ...           ...
635         Westminster  2016  9.955434e+05
636         Westminster  2017  1.064772e+06
637         Westminster  2018  1.020025e+06
638         Westminster  2019  9.553525e+05
639         Westminster  2020  1.002810e+06

[640 rows x 3 columns]

In [18]:
last_20_yrs['pt_change'] = last_20_yrs.groupby('District').avg_price.pct_change(periods=19)

In [19]:
last_20_yrs.loc[last_20_yrs.pt_change == last_20_yrs.pt_change.max(), ['District','pt_change']]

    District  pt_change
219  Hackney    2.71559

### 4. Conclusion

In the last 20 years, the burrough that has seen the greatest change in average housing prices is Hackney.

This was concluded by following these steps:

1. Finding the average prices per burrough per year
2. Grouping by district and applying the pandas function 'pct_change' to each group
3. Adding 'percent change' column to dataframe
4. Filtering the dataframe to only show the one row with the greatest prcnt change